zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_wwdt.h
/*****************************************************************************

  Copyright (C) 2023 Texas Instruments Incorporated - http://www.ti.com/

  Redistribution and use in source and binary forms, with or without
  modification, are permitted provided that the following conditions
  are met:

   Redistributions of source code must retain the above copyright
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

/**
 * @file hw_wwdt.h
 * @brief WWDT 窗口看门狗定时器寄存器定义
 *
 * WWDT (Window Watchdog Timer) 提供窗口模式和间隔定时器两种模式。
 * 窗口模式下，在关闭窗口期间喂狗会触发 ESM 错误信号。
 * 写入寄存器的 KEY 值错误同样会触发 ESM 错误。
 */

#ifndef ti_devices_msp_peripherals_hw_wwdt__include
#define ti_devices_msp_peripherals_hw_wwdt__include

/* Filename: hw_wwdt.h */
/* Revised: 2023-05-10 21:36:51 */
/* Revision: 662977591cca7f583e1df6fe4b402c6c07949212 */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* WWDT Registers
* WWDT 窗口看门狗定时器寄存器
******************************************************************************/
/* CPU 中断和 GPRCM 寄存器组基地址偏移 */
#define WWDT_CPU_INT_OFS                         ((uint32_t)0x00001020U)
#define WWDT_GPRCM_OFS                           ((uint32_t)0x00000800U)


/** @addtogroup WWDT_CPU_INT
  @{
*/

/* CPU 中断控制寄存器组 */
typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001020) 中断索引寄存器 */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001028) 中断掩码寄存器 */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001030) 原始中断状态 */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001038) 屏蔽后中断状态 */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00001040) 中断置位寄存器 */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00001048) 中断清除寄存器 */
} WWDT_CPU_INT_Regs;

/*@}*/ /* end of group WWDT_CPU_INT */

/** @addtogroup WWDT_GPRCM
  @{
*/

/* GPRCM 电源/复位控制寄存器组 */
typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00000800) 电源使能 */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00000804) 复位控制 */
       uint32_t RESERVED0[3];
  __I  uint32_t STAT;                              /* !< (@ 0x00000814) 状态寄存器 */
} WWDT_GPRCM_Regs;

/*@}*/ /* end of group WWDT_GPRCM */

/** @addtogroup WWDT
  @{
*/

/* WWDT 主寄存器结构体 */
typedef struct {
       uint32_t RESERVED0[512];
  WWDT_GPRCM_Regs  GPRCM;                             /* !< (@ 0x00000800) GPRCM 寄存器组 */
       uint32_t RESERVED1[512];
  __IO uint32_t PDBGCTL;                           /* !< (@ 0x00001018) 外设调试控制 - 冻结/自由运行 */
       uint32_t RESERVED2;
  WWDT_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00001020) CPU 中断控制寄存器组 */
       uint32_t RESERVED3[37];
  __IO uint32_t EVT_MODE;                          /* !< (@ 0x000010E0) 事件模式选择 */
       uint32_t RESERVED4[6];
  __I  uint32_t DESC;                              /* !< (@ 0x000010FC) 模块描述寄存器 (版本/ID) */
  __IO uint32_t WWDTCTL0;                          /* !< (@ 0x00001100) 看门狗控制寄存器0 - 周期/窗口/模式 */
  __IO uint32_t WWDTCTL1;                          /* !< (@ 0x00001104) 看门狗控制寄存器1 - 窗口选择 */
  __IO uint32_t WWDTCNTRST;                        /* !< (@ 0x00001108) 看门狗计数器复位 (喂狗寄存器) */
  __I  uint32_t WWDTSTAT;                          /* !< (@ 0x0000110C) 看门狗状态寄存器 */
} WWDT_Regs;

/*@}*/ /* end of group WWDT */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* WWDT Register Control Bits
* WWDT 寄存器位域定义
******************************************************************************/

/*--- 中断索引 (IIDX) 位域 ---*/
/* WWDT_IIDX Bits */
/* WWDT_IIDX[STAT] Bits */
#define WWDT_IIDX_STAT_OFS                       (0)                             /* !< STAT Offset */
#define WWDT_IIDX_STAT_MASK                      ((uint32_t)0x0000001FU)         /* !< Module Interrupt Vector Value.
                                                                                    This register provides the highest
                                                                                    priority interrupt index. A read
                                                                                    clears the corresponding interrupt
                                                                                    flag in RIS and MISC. */
#define WWDT_IIDX_STAT_NO_INTR                   ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define WWDT_IIDX_STAT_INTTIM                    ((uint32_t)0x00000001U)         /* !< Interval Timer Interrupt; Interrupt
                                                                                    Flag: INTTIM; Interrupt Priority:
                                                                                    Highest */

